/*******************************************************************************
 *	@file:		at24c32d.h
 *	@brief:		Заголовочный файл библиотеки для работы
 *******************************************************************************/
#ifndef __H_AT24C32D_
#define __H_AT24C32D_

/*******************************************************************************
 *		INCLUDES
 *******************************************************************************/
#ifdef STM32F446xx
	#include "stm32f4xx_hal.h"
#endif	//	STM32F446xx 

#ifdef STM32F205xx
	#include "stm32f2xx_hal.h"
#endif	//	STM32F205xx

#ifdef __C_I2C_MEM_AT24_
	#define AT24_I2C_MEM_VAL
#else
	#define AT24_I2C_MEM_VAL extern
#endif
	
/*******************************************************************************
 *		DEFINES
 *******************************************************************************/
#define AT24C64_ADDRESS	80
	
/*******************************************************************************
 *		TYPEDEF STRUCTS
 *******************************************************************************/
typedef struct
{
	I2C_HandleTypeDef* hi2c;
}
AT24_I2C_MemPeriph;

/*******************************************************************************
 *		VARIABLES
 *******************************************************************************/
AT24_I2C_MEM_VAL AT24_I2C_MemPeriph mem_periph;

/*******************************************************************************
 *		FUNCTIONS
 *******************************************************************************/
#ifdef __cplusplus
extern "C" {
#endif

/**
 *	@brief		AT24_I2C_SetPeriph
 *	@remark		Установка периферии для работы с памятью.
 *	@param		hi2c	-	Указатель на объект для работы с памятью.
 *  @retval		NONE
 */
int AT24_I2C_SetPeriph		( I2C_HandleTypeDef* hi2c );
/**
 *	@brief		AT24_I2C_MemoryRead.
 *	@remark		Функция считывания данных из памяти AT24C32D
 *	@param		address - Адрес для считывания данных.
 *	@param		data	- Указатель на массив для сохранения вычитанных данных.
 *	@param		num		- Количество данных для считывания.
 */
int AT24_I2C_MemoryRead 	( int address, unsigned char* data, uint16_t num );
/**
 *	@brief	AT24_I2C_MemoryWrite
 *	@remark	Функция записи данных в память.
 *	@param	address 	- Адрес для записи данных.
 *	@param	data 		- Указатель на массив с записываемыми данными.
 *	@param	num			- Кол-во данных для записи.
 */
int AT24_I2C_MemoryWrite 	( int address, unsigned char* data, uint16_t num );

#ifdef __cplusplus
};
#endif

#endif	//	__H_AT24C32D_
